ycsb_logs/run.log
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 3268
[OVERALL], Throughput(ops/sec), 30599.755201958385
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 88
[READ], AverageLatency(us), 60.48863636363637
[READ], MinLatency(us), 19
[READ], MaxLatency(us), 2085
[READ], 95thPercentileLatency(us), 64
[READ], 99thPercentileLatency(us), 2085
[READ], Return=OK, 88
[READ], Return=ERROR, 4918
[DELETE], Operations, 3000
[DELETE], AverageLatency(us), 26.788333333333334
[DELETE], MinLatency(us), 13
[DELETE], MaxLatency(us), 2599
[DELETE], 95thPercentileLatency(us), 44
[DELETE], 99thPercentileLatency(us), 52
[DELETE], Return=OK, 3000
[DELETE], Return=ERROR, 91994
[DELETE-FAILED], Operations, 91994
[DELETE-FAILED], AverageLatency(us), 32.45801900123921
[DELETE-FAILED], MinLatency(us), 26
[DELETE-FAILED], MaxLatency(us), 836
[DELETE-FAILED], 95thPercentileLatency(us), 43
[DELETE-FAILED], 99thPercentileLatency(us), 48
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 498.0
[CLEANUP], MinLatency(us), 498
[CLEANUP], MaxLatency(us), 498
[CLEANUP], 95thPercentileLatency(us), 498
[CLEANUP], 99thPercentileLatency(us), 498
[READ-FAILED], Operations, 4918
[READ-FAILED], AverageLatency(us), 16.44794631964213
[READ-FAILED], MinLatency(us), 13
[READ-FAILED], MaxLatency(us), 459
[READ-FAILED], 95thPercentileLatency(us), 22
[READ-FAILED], 99thPercentileLatency(us), 27
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 3349
[OVERALL], Throughput(ops/sec), 29859.65959988056
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 70
[READ], AverageLatency(us), 69.17142857142858
[READ], MinLatency(us), 32
[READ], MaxLatency(us), 1447
[READ], 95thPercentileLatency(us), 69
[READ], 99thPercentileLatency(us), 1447
[READ], Return=OK, 70
[READ], Return=ERROR, 4942
[DELETE], Operations, 2872
[DELETE], AverageLatency(us), 32.47493036211699
[DELETE], MinLatency(us), 14
[DELETE], MaxLatency(us), 1478
[DELETE], 95thPercentileLatency(us), 47
[DELETE], 99thPercentileLatency(us), 58
[DELETE], Return=OK, 2872
[DELETE], Return=ERROR, 92116
[DELETE-FAILED], Operations, 92116
[DELETE-FAILED], AverageLatency(us), 33.06834860393417
[DELETE-FAILED], MinLatency(us), 26
[DELETE-FAILED], MaxLatency(us), 6191
[DELETE-FAILED], 95thPercentileLatency(us), 43
[DELETE-FAILED], 99thPercentileLatency(us), 49
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 337.0
[CLEANUP], MinLatency(us), 337
[CLEANUP], MaxLatency(us), 337
[CLEANUP], 95thPercentileLatency(us), 337
[CLEANUP], 99thPercentileLatency(us), 337
[READ-FAILED], Operations, 4942
[READ-FAILED], AverageLatency(us), 16.86887899635775
[READ-FAILED], MinLatency(us), 13
[READ-FAILED], MaxLatency(us), 183
[READ-FAILED], 95thPercentileLatency(us), 24
[READ-FAILED], 99thPercentileLatency(us), 29
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2962
[OVERALL], Throughput(ops/sec), 33760.9723160027
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 72
[READ], AverageLatency(us), 107.29166666666667
[READ], MinLatency(us), 19
[READ], MaxLatency(us), 4187
[READ], 95thPercentileLatency(us), 85
[READ], 99thPercentileLatency(us), 4187
[READ], Return=OK, 72
[READ], Return=ERROR, 4923
[DELETE], Operations, 2744
[DELETE], AverageLatency(us), 31.25874635568513
[DELETE], MinLatency(us), 13
[DELETE], MaxLatency(us), 548
[DELETE], 95thPercentileLatency(us), 45
[DELETE], 99thPercentileLatency(us), 54
[DELETE], Return=OK, 2744
[DELETE], Return=ERROR, 92261
[DELETE-FAILED], Operations, 92261
[DELETE-FAILED], AverageLatency(us), 29.040190329608393
[DELETE-FAILED], MinLatency(us), 26
[DELETE-FAILED], MaxLatency(us), 940
[DELETE-FAILED], 95thPercentileLatency(us), 40
[DELETE-FAILED], 99thPercentileLatency(us), 44
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 334.0
[CLEANUP], MinLatency(us), 334
[CLEANUP], MaxLatency(us), 334
[CLEANUP], 95thPercentileLatency(us), 334
[CLEANUP], 99thPercentileLatency(us), 334
[READ-FAILED], Operations, 4923
[READ-FAILED], AverageLatency(us), 14.579321551899248
[READ-FAILED], MinLatency(us), 13
[READ-FAILED], MaxLatency(us), 109
[READ-FAILED], 95thPercentileLatency(us), 21
[READ-FAILED], 99thPercentileLatency(us), 27
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2926
[OVERALL], Throughput(ops/sec), 34176.34996582365
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 62
[READ], AverageLatency(us), 70.79032258064517
[READ], MinLatency(us), 18
[READ], MaxLatency(us), 2533
[READ], 95thPercentileLatency(us), 62
[READ], 99thPercentileLatency(us), 2533
[READ], Return=OK, 62
[READ], Return=ERROR, 4824
[DELETE], Operations, 2616
[DELETE], AverageLatency(us), 24.04051987767584
[DELETE], MinLatency(us), 14
[DELETE], MaxLatency(us), 313
[DELETE], 95thPercentileLatency(us), 42
[DELETE], 99thPercentileLatency(us), 46
[DELETE], Return=OK, 2616
[DELETE], Return=ERROR, 92498
[DELETE-FAILED], Operations, 92498
[DELETE-FAILED], AverageLatency(us), 29.0278816839283
[DELETE-FAILED], MinLatency(us), 26
[DELETE-FAILED], MaxLatency(us), 1589
[DELETE-FAILED], 95thPercentileLatency(us), 30
[DELETE-FAILED], 99thPercentileLatency(us), 42
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 350.0
[CLEANUP], MinLatency(us), 350
[CLEANUP], MaxLatency(us), 350
[CLEANUP], 95thPercentileLatency(us), 350
[CLEANUP], 99thPercentileLatency(us), 350
[READ-FAILED], Operations, 4824
[READ-FAILED], AverageLatency(us), 14.560945273631841
[READ-FAILED], MinLatency(us), 13
[READ-FAILED], MaxLatency(us), 115
[READ-FAILED], 95thPercentileLatency(us), 16
[READ-FAILED], 99thPercentileLatency(us), 26
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2898
[OVERALL], Throughput(ops/sec), 34506.55624568668
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 68
[READ], AverageLatency(us), 49.720588235294116
[READ], MinLatency(us), 19
[READ], MaxLatency(us), 1353
[READ], 95thPercentileLatency(us), 50
[READ], 99thPercentileLatency(us), 1353
[READ], Return=OK, 68
[READ], Return=ERROR, 4862
[DELETE], Operations, 2488
[DELETE], AverageLatency(us), 23.866157556270096
[DELETE], MinLatency(us), 14
[DELETE], MaxLatency(us), 1404
[DELETE], 95thPercentileLatency(us), 31
[DELETE], 99thPercentileLatency(us), 40
[DELETE], Return=OK, 2488
[DELETE], Return=ERROR, 92582
[DELETE-FAILED], Operations, 92582
[DELETE-FAILED], AverageLatency(us), 28.852282301095244
[DELETE-FAILED], MinLatency(us), 27
[DELETE-FAILED], MaxLatency(us), 896
[DELETE-FAILED], 95thPercentileLatency(us), 30
[DELETE-FAILED], 99thPercentileLatency(us), 32
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 343.0
[CLEANUP], MinLatency(us), 343
[CLEANUP], MaxLatency(us), 343
[CLEANUP], 95thPercentileLatency(us), 343
[CLEANUP], 99thPercentileLatency(us), 343
[READ-FAILED], Operations, 4862
[READ-FAILED], AverageLatency(us), 14.46194981489099
[READ-FAILED], MinLatency(us), 13
[READ-FAILED], MaxLatency(us), 793
[READ-FAILED], 95thPercentileLatency(us), 16
[READ-FAILED], 99thPercentileLatency(us), 17
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 3029
[OVERALL], Throughput(ops/sec), 33014.19610432486
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 64
[READ], AverageLatency(us), 52.234375
[READ], MinLatency(us), 18
[READ], MaxLatency(us), 1421
[READ], 95thPercentileLatency(us), 48
[READ], 99thPercentileLatency(us), 1421
[READ], Return=OK, 64
[READ], Return=ERROR, 4821
[DELETE], Operations, 2360
[DELETE], AverageLatency(us), 22.99957627118644
[DELETE], MinLatency(us), 13
[DELETE], MaxLatency(us), 1445
[DELETE], 95thPercentileLatency(us), 31
[DELETE], 99thPercentileLatency(us), 37
[DELETE], Return=OK, 2360
[DELETE], Return=ERROR, 92755
[DELETE-FAILED], Operations, 92755
[DELETE-FAILED], AverageLatency(us), 30.137027653495768
[DELETE-FAILED], MinLatency(us), 25
[DELETE-FAILED], MaxLatency(us), 840
[DELETE-FAILED], 95thPercentileLatency(us), 41
[DELETE-FAILED], 99thPercentileLatency(us), 44
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 343.0
[CLEANUP], MinLatency(us), 343
[CLEANUP], MaxLatency(us), 343
[CLEANUP], 95thPercentileLatency(us), 343
[CLEANUP], 99thPercentileLatency(us), 343
[READ-FAILED], Operations, 4821
[READ-FAILED], AverageLatency(us), 15.23459863098942
[READ-FAILED], MinLatency(us), 13
[READ-FAILED], MaxLatency(us), 641
[READ-FAILED], 95thPercentileLatency(us), 21
[READ-FAILED], 99thPercentileLatency(us), 23
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 3161
[OVERALL], Throughput(ops/sec), 31635.558367605187
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 70
[READ], AverageLatency(us), 70.67142857142858
[READ], MinLatency(us), 27
[READ], MaxLatency(us), 1362
[READ], 95thPercentileLatency(us), 99
[READ], 99thPercentileLatency(us), 1362
[READ], Return=OK, 70
[READ], Return=ERROR, 5176
[DELETE], Operations, 2232
[DELETE], AverageLatency(us), 33.693996415770606
[DELETE], MinLatency(us), 14
[DELETE], MaxLatency(us), 288
[DELETE], 95thPercentileLatency(us), 48
[DELETE], 99thPercentileLatency(us), 73
[DELETE], Return=OK, 2232
[DELETE], Return=ERROR, 92522
[DELETE-FAILED], Operations, 92522
[DELETE-FAILED], AverageLatency(us), 31.200633362875855
[DELETE-FAILED], MinLatency(us), 26
[DELETE-FAILED], MaxLatency(us), 1528
[DELETE-FAILED], 95thPercentileLatency(us), 42
[DELETE-FAILED], 99thPercentileLatency(us), 46
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 316.0
[CLEANUP], MinLatency(us), 316
[CLEANUP], MaxLatency(us), 316
[CLEANUP], 95thPercentileLatency(us), 316
[CLEANUP], 99thPercentileLatency(us), 316
[READ-FAILED], Operations, 5176
[READ-FAILED], AverageLatency(us), 16.06240340030912
[READ-FAILED], MinLatency(us), 13
[READ-FAILED], MaxLatency(us), 247
[READ-FAILED], 95thPercentileLatency(us), 23
[READ-FAILED], 99thPercentileLatency(us), 29
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2981
[OVERALL], Throughput(ops/sec), 33545.79000335458
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 40
[READ], AverageLatency(us), 42.05
[READ], MinLatency(us), 18
[READ], MaxLatency(us), 111
[READ], 95thPercentileLatency(us), 76
[READ], 99thPercentileLatency(us), 111
[READ], Return=OK, 40
[READ], Return=ERROR, 4957
[DELETE], Operations, 2104
[DELETE], AverageLatency(us), 28.932509505703422
[DELETE], MinLatency(us), 13
[DELETE], MaxLatency(us), 227
[DELETE], 95thPercentileLatency(us), 46
[DELETE], 99thPercentileLatency(us), 58
[DELETE], Return=OK, 2104
[DELETE], Return=ERROR, 92899
[DELETE-FAILED], Operations, 92899
[DELETE-FAILED], AverageLatency(us), 29.43063972701536
[DELETE-FAILED], MinLatency(us), 26
[DELETE-FAILED], MaxLatency(us), 1862
[DELETE-FAILED], 95thPercentileLatency(us), 40
[DELETE-FAILED], 99thPercentileLatency(us), 43
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 482.0
[CLEANUP], MinLatency(us), 482
[CLEANUP], MaxLatency(us), 482
[CLEANUP], 95thPercentileLatency(us), 482
[CLEANUP], 99thPercentileLatency(us), 482
[READ-FAILED], Operations, 4957
[READ-FAILED], AverageLatency(us), 15.329029655033287
[READ-FAILED], MinLatency(us), 13
[READ-FAILED], MaxLatency(us), 2081
[READ-FAILED], 95thPercentileLatency(us), 21
[READ-FAILED], 99thPercentileLatency(us), 27
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 3158
[OVERALL], Throughput(ops/sec), 31665.611146295123
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 53
[READ], AverageLatency(us), 68.0754716981132
[READ], MinLatency(us), 19
[READ], MaxLatency(us), 1442
[READ], 95thPercentileLatency(us), 59
[READ], 99thPercentileLatency(us), 1442
[READ], Return=OK, 53
[READ], Return=ERROR, 4886
[DELETE], Operations, 1976
[DELETE], AverageLatency(us), 30.481275303643724
[DELETE], MinLatency(us), 14
[DELETE], MaxLatency(us), 667
[DELETE], 95thPercentileLatency(us), 44
[DELETE], 99thPercentileLatency(us), 67
[DELETE], Return=OK, 1976
[DELETE], Return=ERROR, 93085
[DELETE-FAILED], Operations, 93085
[DELETE-FAILED], AverageLatency(us), 31.257925551914916
[DELETE-FAILED], MinLatency(us), 26
[DELETE-FAILED], MaxLatency(us), 1509
[DELETE-FAILED], 95thPercentileLatency(us), 42
[DELETE-FAILED], 99thPercentileLatency(us), 44
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 496.0
[CLEANUP], MinLatency(us), 496
[CLEANUP], MaxLatency(us), 496
[CLEANUP], 95thPercentileLatency(us), 496
[CLEANUP], 99thPercentileLatency(us), 496
[READ-FAILED], Operations, 4886
[READ-FAILED], AverageLatency(us), 15.877609496520671
[READ-FAILED], MinLatency(us), 13
[READ-FAILED], MaxLatency(us), 171
[READ-FAILED], 95thPercentileLatency(us), 22
[READ-FAILED], 99thPercentileLatency(us), 27